// Тобі потрібно зберігати ім’я та прізвище в змінній, придумай до 4-х імен змінних, що потрібні тобі для даної задачі. 
// Також напиши до 5 неправильних імен (неправильні імена повинні бути закоментовані);

let firstName = "Viktor";
let lastName = "Pyrih";
let fullName = firstName + " " + lastName;
let age = 26;

// 1. 2name (починається з цифри)
// 2. last-name (містить дефіс)
// 3. first name (пробіл між словами)
// 4. first+name (змінні не можуть містити математичних операторів)
// 5. age-in-years! (містить спеціальний символ)




// Вкажи всі можливі способи коментування коду;

Однорядкові коментарі починаються з подвійної косої риски //.

// Цей коментар займає весь рядок
alert('Привіт');

alert('Світ'); // Цей коментар міститься після інструкції


Багаторядкові коментарі починаються з косої риски з зірочкою /* і закінчується зірочкою з косою рискою */.

    /* Приклад із двома повідомленнями.
    Це багаторядковий коментар.
    */
    alert('Привіт');
alert('Світ');




// Які стилі написання імен змінних ти знаєш?

Імена записуются з великої літери для кожного слова, крім першого.
    Наприклад: firstName, lastName

Імена записуються з великої літери для кожного слова
Наприклад: FirstName, LastName

Імена записуються малими літерами, і слова розділяються символом підкреслення "_"
Наприклад: first_name, last_name

Імена записуються у верхньому регістрі, розділяються символом підкреслення "_"
Наприклад: FIRST - NAME, LAST - NAME